Repository: paulber19/recuvaAccessEnhancementNVDAAddon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: File' type to retrive:
ru: Тип файла для восстановления

source: Where to search:
ru: Где искать:

source: Search's result:
ru: Результаты поиска:

source: Search's location:
ru: Место поиска:

source: File's type:
ru: Тип файла:

source: Report the result of the search
ru: Сообщить о результатах поиска

source: Recuva file recovery: accessibility enhancement
ru: Восстановление файлов Recuva: улучшение доступности

source: Although this application is relatively well accessible, this extension attempts to improve the accessibility of the Recuva file recovery software by: * naming certain unlabeled objects, * preventing unnecessary focus from being placed on unknown objects, * adding the script "KEY_Search_RESULT" to re-read the overall result of the search, * automatically maximizing the window displaying the search result.
ru: Хотя данное приложение относительно доступно для использования, это дополнение пытается улучшить доступность программы восстановления файлов Recuva следующим образом: присвоение имен определенным объектам без меток, предотвращение ненужной фокусировки на неизвестных объектах, добавление скрипта «KEY_Search_RESULT» для повторного чтения общего результата поиска, автоматическое разворачивание окна с результатом поиска.

source: %s add-on - settings
ru: Дополнение %s - настройки

source: Update
ru: Обновление

source: Automatically check for &updates
ru: Автоматически проверять &обновления

source: Update also release versions to &developpement versions
ru: Обновить также выпуск версий до &разрабатываемых версий

source: &Check for update
ru: &Проверить обновления

source: View &history
ru: Просмотр &истории

source: Downloading {name}
ru: Загрузка {name}

source: Error downloading update for {name}.
ru: Ошибка при загрузке обновления для {name}.

source: Cannot update {name} - missing file or invalid file format
ru: Не удается обновить {name} - отсутствует файл или неверный формат файла

source: Updating
ru: Обновление

source: Please wait while the add-on is being updated.
ru: Пожалуйста, подождите, пока дополнение обновляется.

source: Failed to update {name} add-on
ru: Не удалось обновить дополнение {name}.

source: {summary} - update
ru: {summary} - обновление

source: The service is temporarily under maintenance. Please, try again later.
ru: Сервис временно находится на техническом обслуживании. Пожалуйста, повторите попытку позже.

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
ru: Обновление несовместимо с этой версией NVDA. Минимальная версия NVDA: {minYear}.{minMajor}, последнее тестируемая: {testedYear}.{testedMajor}.

source: New version%s is available. Do you want to download it now?
ru: Доступна новая версия %s. Хотите скачать ее прямо сейчас?

source: New version{0} is available. But it is not compatible with this version of NVDA: minimum version requred = {1}, last version tested = {2}. Do you want to ignore this incompatibility and still download it now?
ru: Доступна новая версия{0}. Но она несовместима с этой версией NVDA: минимальная требуемая версия = {1}, последняя проверенная версия = {2}. Хотите ли вы проигнорировать эту несовместимость и скачать ее сейчас?

source: You are up-to-date. %s is the latest version.
ru: Вы в курсе последних событий. %s - это последняя версия.

source: Oops! There was a problem checking for updates. Please retry later
ru: Опа! Не удалось проверить наличие обновлений. Пожалуйста, повторите попытку позже

source: &Yes
ru: &Да

source: &No
ru: &Нет

source: &Later
ru: &Позже

source: Wha&t's new
ru: &Что нового

source: Do you want to keep current add-on configuration settings ?
ru: Хотите ли вы сохранить текущие настройки конфигурации дополнения?

source: %s - installation
ru: %s - установка

source: Are you sure you don't want to keep the current add-on configuration settings?
ru: Вы уверены, что не хотите сохранить текущие настройки конфигурации дополнения?

source: The configuration file of the add-on contains errors. The configuration has been reset to factory defaults
ru: Конфигурационный файл дополнения содержит ошибки. Конфигурация была сброшена до заводских настроек по умолчанию

source: Warning
ru: Внимание
